MikroElektronika/core_packages/ARM/gcc_clang/system/src/sam/atsame51/thirdparty/atsame51/component/sdhc.h
#define SDHC_NISIER_CMDC_Pos                  _U_(0)                                               /**< (SDHC_NISIER) Command Complete Signal Enable Position */
#define SDHC_NISIER_CMDC_Msk                  (_U_(0x1) << SDHC_NISIER_CMDC_Pos)                   /**< (SDHC_NISIER) Command Complete Signal Enable Mask */
#define SDHC_NISIER_CMDC(value)               (SDHC_NISIER_CMDC_Msk & ((value) << SDHC_NISIER_CMDC_Pos))
#define   SDHC_NISIER_CMDC_MASKED_Val         _U_(0x0)                                             /**< (SDHC_NISIER) Masked  */
#define   SDHC_NISIER_CMDC_ENABLED_Val        _U_(0x1)                                             /**< (SDHC_NISIER) Enabled  */
#define SDHC_NISIER_CMDC_MASKED               (SDHC_NISIER_CMDC_MASKED_Val << SDHC_NISIER_CMDC_Pos) /**< (SDHC_NISIER) Masked Position  */
#define SDHC_NISIER_CMDC_ENABLED              (SDHC_NISIER_CMDC_ENABLED_Val << SDHC_NISIER_CMDC_Pos) /**< (SDHC_NISIER) Enabled Position  */
#define SDHC_NISIER_TRFC_Pos                  _U_(1)                                               /**< (SDHC_NISIER) Transfer Complete Signal Enable Position */
#define SDHC_NISIER_TRFC_Msk                  (_U_(0x1) << SDHC_NISIER_TRFC_Pos)                   /**< (SDHC_NISIER) Transfer Complete Signal Enable Mask */
#define SDHC_NISIER_TRFC(value)               (SDHC_NISIER_TRFC_Msk & ((value) << SDHC_NISIER_TRFC_Pos))
#define   SDHC_NISIER_TRFC_MASKED_Val         _U_(0x0)                                             /**< (SDHC_NISIER) Masked  */
#define   SDHC_NISIER_TRFC_ENABLED_Val        _U_(0x1)                                             /**< (SDHC_NISIER) Enabled  */
#define SDHC_NISIER_TRFC_MASKED               (SDHC_NISIER_TRFC_MASKED_Val << SDHC_NISIER_TRFC_Pos) /**< (SDHC_NISIER) Masked Position  */
#define SDHC_NISIER_TRFC_ENABLED              (SDHC_NISIER_TRFC_ENABLED_Val << SDHC_NISIER_TRFC_Pos) /**< (SDHC_NISIER) Enabled Position  */
#define SDHC_NISIER_BLKGE_Pos                 _U_(2)                                               /**< (SDHC_NISIER) Block Gap Event Signal Enable Position */
#define SDHC_NISIER_BLKGE_Msk                 (_U_(0x1) << SDHC_NISIER_BLKGE_Pos)                  /**< (SDHC_NISIER) Block Gap Event Signal Enable Mask */
#define SDHC_NISIER_BLKGE(value)              (SDHC_NISIER_BLKGE_Msk & ((value) << SDHC_NISIER_BLKGE_Pos))
#define   SDHC_NISIER_BLKGE_MASKED_Val        _U_(0x0)                                             /**< (SDHC_NISIER) Masked  */
#define   SDHC_NISIER_BLKGE_ENABLED_Val       _U_(0x1)                                             /**< (SDHC_NISIER) Enabled  */
#define SDHC_NISIER_BLKGE_MASKED              (SDHC_NISIER_BLKGE_MASKED_Val << SDHC_NISIER_BLKGE_Pos) /**< (SDHC_NISIER) Masked Position  */
#define SDHC_NISIER_BLKGE_ENABLED             (SDHC_NISIER_BLKGE_ENABLED_Val << SDHC_NISIER_BLKGE_Pos) /**< (SDHC_NISIER) Enabled Position  */
#define SDHC_NISIER_DMAINT_Pos                _U_(3)                                               /**< (SDHC_NISIER) DMA Interrupt Signal Enable Position */
#define SDHC_NISIER_DMAINT_Msk                (_U_(0x1) << SDHC_NISIER_DMAINT_Pos)                 /**< (SDHC_NISIER) DMA Interrupt Signal Enable Mask */
#define SDHC_NISIER_DMAINT(value)             (SDHC_NISIER_DMAINT_Msk & ((value) << SDHC_NISIER_DMAINT_Pos))
#define   SDHC_NISIER_DMAINT_MASKED_Val       _U_(0x0)                                             /**< (SDHC_NISIER) Masked  */
#define   SDHC_NISIER_DMAINT_ENABLED_Val      _U_(0x1)                                             /**< (SDHC_NISIER) Enabled  */
#define SDHC_NISIER_DMAINT_MASKED             (SDHC_NISIER_DMAINT_MASKED_Val << SDHC_NISIER_DMAINT_Pos) /**< (SDHC_NISIER) Masked Position  */
#define SDHC_NISIER_DMAINT_ENABLED            (SDHC_NISIER_DMAINT_ENABLED_Val << SDHC_NISIER_DMAINT_Pos) /**< (SDHC_NISIER) Enabled Position  */
#define SDHC_NISIER_BWRRDY_Pos                _U_(4)                                               /**< (SDHC_NISIER) Buffer Write Ready Signal Enable Position */
#define SDHC_NISIER_BWRRDY_Msk                (_U_(0x1) << SDHC_NISIER_BWRRDY_Pos)                 /**< (SDHC_NISIER) Buffer Write Ready Signal Enable Mask */
#define SDHC_NISIER_BWRRDY(value)             (SDHC_NISIER_BWRRDY_Msk & ((value) << SDHC_NISIER_BWRRDY_Pos))
#define   SDHC_NISIER_BWRRDY_MASKED_Val       _U_(0x0)                                             /**< (SDHC_NISIER) Masked  */
#define   SDHC_NISIER_BWRRDY_ENABLED_Val      _U_(0x1)                                             /**< (SDHC_NISIER) Enabled  */
#define SDHC_NISIER_BWRRDY_MASKED             (SDHC_NISIER_BWRRDY_MASKED_Val << SDHC_NISIER_BWRRDY_Pos) /**< (SDHC_NISIER) Masked Position  */
#define SDHC_NISIER_BWRRDY_ENABLED            (SDHC_NISIER_BWRRDY_ENABLED_Val << SDHC_NISIER_BWRRDY_Pos) /**< (SDHC_NISIER) Enabled Position  */
#define SDHC_NISIER_BRDRDY_Pos                _U_(5)                                               /**< (SDHC_NISIER) Buffer Read Ready Signal Enable Position */
#define SDHC_NISIER_BRDRDY_Msk                (_U_(0x1) << SDHC_NISIER_BRDRDY_Pos)                 /**< (SDHC_NISIER) Buffer Read Ready Signal Enable Mask */
#define SDHC_NISIER_BRDRDY(value)             (SDHC_NISIER_BRDRDY_Msk & ((value) << SDHC_NISIER_BRDRDY_Pos))
#define   SDHC_NISIER_BRDRDY_MASKED_Val       _U_(0x0)                                             /**< (SDHC_NISIER) Masked  */
#define   SDHC_NISIER_BRDRDY_ENABLED_Val      _U_(0x1)                                             /**< (SDHC_NISIER) Enabled  */
#define SDHC_NISIER_BRDRDY_MASKED             (SDHC_NISIER_BRDRDY_MASKED_Val << SDHC_NISIER_BRDRDY_Pos) /**< (SDHC_NISIER) Masked Position  */
#define SDHC_NISIER_BRDRDY_ENABLED            (SDHC_NISIER_BRDRDY_ENABLED_Val << SDHC_NISIER_BRDRDY_Pos) /**< (SDHC_NISIER) Enabled Position  */
#define SDHC_NISIER_CINS_Pos                  _U_(6)                                               /**< (SDHC_NISIER) Card Insertion Signal Enable Position */
#define SDHC_NISIER_CINS_Msk                  (_U_(0x1) << SDHC_NISIER_CINS_Pos)                   /**< (SDHC_NISIER) Card Insertion Signal Enable Mask */
#define SDHC_NISIER_CINS(value)               (SDHC_NISIER_CINS_Msk & ((value) << SDHC_NISIER_CINS_Pos))
#define   SDHC_NISIER_CINS_MASKED_Val         _U_(0x0)                                             /**< (SDHC_NISIER) Masked  */
#define   SDHC_NISIER_CINS_ENABLED_Val        _U_(0x1)                                             /**< (SDHC_NISIER) Enabled  */
#define SDHC_NISIER_CINS_MASKED               (SDHC_NISIER_CINS_MASKED_Val << SDHC_NISIER_CINS_Pos) /**< (SDHC_NISIER) Masked Position  */
#define SDHC_NISIER_CINS_ENABLED              (SDHC_NISIER_CINS_ENABLED_Val << SDHC_NISIER_CINS_Pos) /**< (SDHC_NISIER) Enabled Position  */
#define SDHC_NISIER_CREM_Pos                  _U_(7)                                               /**< (SDHC_NISIER) Card Removal Signal Enable Position */
#define SDHC_NISIER_CREM_Msk                  (_U_(0x1) << SDHC_NISIER_CREM_Pos)                   /**< (SDHC_NISIER) Card Removal Signal Enable Mask */
#define SDHC_NISIER_CREM(value)               (SDHC_NISIER_CREM_Msk & ((value) << SDHC_NISIER_CREM_Pos))
#define   SDHC_NISIER_CREM_MASKED_Val         _U_(0x0)                                             /**< (SDHC_NISIER) Masked  */
#define   SDHC_NISIER_CREM_ENABLED_Val        _U_(0x1)                                             /**< (SDHC_NISIER) Enabled  */
#define SDHC_NISIER_CREM_MASKED               (SDHC_NISIER_CREM_MASKED_Val << SDHC_NISIER_CREM_Pos) /**< (SDHC_NISIER) Masked Position  */
#define SDHC_NISIER_CREM_ENABLED              (SDHC_NISIER_CREM_ENABLED_Val << SDHC_NISIER_CREM_Pos) /**< (SDHC_NISIER) Enabled Position  */
#define SDHC_NISIER_CINT_Pos                  _U_(8)                                               /**< (SDHC_NISIER) Card Interrupt Signal Enable Position */
#define SDHC_NISIER_CINT_Msk                  (_U_(0x1) << SDHC_NISIER_CINT_Pos)                   /**< (SDHC_NISIER) Card Interrupt Signal Enable Mask */
#define SDHC_NISIER_CINT(value)               (SDHC_NISIER_CINT_Msk & ((value) << SDHC_NISIER_CINT_Pos))
#define   SDHC_NISIER_CINT_MASKED_Val         _U_(0x0)                                             /**< (SDHC_NISIER) Masked  */
#define   SDHC_NISIER_CINT_ENABLED_Val        _U_(0x1)                                             /**< (SDHC_NISIER) Enabled  */
#define SDHC_NISIER_CINT_MASKED               (SDHC_NISIER_CINT_MASKED_Val << SDHC_NISIER_CINT_Pos) /**< (SDHC_NISIER) Masked Position  */
#define SDHC_NISIER_CINT_ENABLED              (SDHC_NISIER_CINT_ENABLED_Val << SDHC_NISIER_CINT_Pos) /**< (SDHC_NISIER) Enabled Position  */
#define SDHC_NISIER_Msk                       _U_(0x01FF)                                          /**< (SDHC_NISIER) Register Mask  */

/* EMMC mode */
#define SDHC_NISIER_EMMC_BOOTAR_Pos           _U_(14)                                              /**< (SDHC_NISIER) Boot Acknowledge Received Signal Enable Position */
#define SDHC_NISIER_EMMC_BOOTAR_Msk           (_U_(0x1) << SDHC_NISIER_EMMC_BOOTAR_Pos)            /**< (SDHC_NISIER) Boot Acknowledge Received Signal Enable Mask */
#define SDHC_NISIER_EMMC_BOOTAR(value)        (SDHC_NISIER_EMMC_BOOTAR_Msk & ((value) << SDHC_NISIER_EMMC_BOOTAR_Pos))
#define SDHC_NISIER_EMMC_Msk                  _U_(0x4000)                                           /**< (SDHC_NISIER_EMMC) Register Mask  */


